Tekla.Structures.Datatype.String
The String datatype.

Tekla.Structures.Datatype.String.#ctor(System.String)
Creates a new string datatype instance.
text: The value for the string datatype.

Tekla.Structures.Datatype.String.Value
The value of the string datatype.

Tekla.Structures.Datatype.String.op_Implicit(Tekla.Structures.Datatype.String)~System.String
Converts from Datatype.String to string.
From: The value to be converted.
Returns: The converted string value.

Tekla.Structures.Datatype.String.op_Implicit(System.String)~Tekla.Structures.Datatype.String
Converts from string to Datatype.String.
From: The value to be converted.
Returns: The converted Datatype.String value.

Tekla.Structures.Datatype.String.op_Equality(System.String,Tekla.Structures.Datatype.String)
Compares a string value with a Datatype.String value.
Left: The string value to be compared.
Right: The Datatype.String value to be compared.
Returns: True if the values are the same.

Tekla.Structures.Datatype.String.op_Inequality(System.String,Tekla.Structures.Datatype.String)
Compares a string value with a Datatype.String value.
Left: The string value to be compared.
Right: The Datatype.String value to be compared.
Returns: True if the values are different.

Tekla.Structures.Datatype.String.Equals(System.Object)
Returns a value that indicates whether the current instance is equal to the given object.
Obj: The object to be used for comparing.
Returns: True if the given object has the same value as the current instance.

Tekla.Structures.Datatype.String.GetHashCode
Returns the hash code for the current instance.
Returns: A hash code for the current String instance.

Tekla.Structures.Datatype.String.ToString
Returns the string representation of the object.
Returns: The string representation of the object.

Tekla.Structures.Datatype.String.GetSchema
Gets the XML Schema for the datatype.
Returns: The datatype's XML Schema.

Tekla.Structures.Datatype.String.ReadXml(System.Xml.XmlReader)
Parses a new value from the given reader.
reader: The reader to be used.

Tekla.Structures.Datatype.String.WriteXml(System.Xml.XmlWriter)
Writes the value as XML to the given writer.
writer: The writer to be used.